In [2]:
import numpy as np 
import pandas as pd

In [7]:
prenoms = ['liz', 'bob', 'bill', 'eve']
age= pd.Series([20, 25, 30, 45], index=prenoms)
taille= pd.Series([160,165,175,180], index=prenoms)
sexe= pd.Series(list('fhhf'),index=prenoms)

In [9]:
df= pd.DataFrame({"age":age,
                 "taille":taille,
                 "sexe":sexe})

In [16]:
df[age>25]

      age  taille sexe
bill   30     175    h
eve    45     180    f

In [18]:
df.index

Index(['liz', 'bob', 'bill', 'eve'], dtype='object')

In [20]:
df.columns

Index(['age', 'taille', 'sexe'], dtype='object')

In [22]:
df.head(2)

     age  taille sexe
liz   20     160    f
bob   25     165    h

In [24]:
df.tail(2)

      age  taille sexe
bill   30     175    h
eve    45     180    f

In [35]:
df.describe()

             age      taille
count   4.000000    4.000000
mean   30.000000  170.000000
std    10.801234    9.128709
min    20.000000  160.000000
25%    23.750000  163.750000
50%    27.500000  170.000000
75%    33.750000  176.250000
max    45.000000  180.000000

In [36]:
df.count(axis=0)

age       4
taille    4
sexe      4
dtype: int64

In [51]:
df.loc[df.loc[:,"age"]>25]

      age  taille sexe
bill   30     175    h
eve    45     180    f

In [53]:
df

      age  taille sexe
liz    20     160    f
bob    25     165    h
bill   30     175    h
eve    45     180    f

In [62]:
df= pd.DataFrame({"age":age,
                 "taille":taille,
                 "sexe":sexe})

In [64]:
df= df.reset_index()

In [71]:
df.rename(columns={"index":"prenom"})

   level_0 prenom  age  taille sexe
0        0    liz   20     160    f
1        1    bob   25     165    h
2        2   bill   30     175    h
3        3    eve   45     180    f

In [73]:
df= pd.DataFrame({"age":age,
                 "taille":taille,
                 "sexe":sexe})

In [78]:
df= (df.reset_index().rename(columns={"index":"prenom"}).set_index("age"))

In [80]:
df

    prenom  taille sexe
age
20     liz     160    f
25     bob     165    h
30    bill     175    h
45     eve     180    f

In [82]:
df1 = pd.DataFrame(np.ones((2, 2)), index=list('ab'), columns=list('xy'))
df1

     x    y
a  1.0  1.0
b  1.0  1.0

In [84]:
df2 = pd.DataFrame(np.ones((2, 2)), index=list('ac'), columns=list('xz'))
df2

     x    z
a  1.0  1.0
c  1.0  1.0

In [86]:
df1+df2

     x   y   z
a  2.0 NaN NaN
b  NaN NaN NaN
c  NaN NaN NaN

In [88]:
df= df1.add(df2, fill_value=0)

In [90]:
df

     x    y    z
a  2.0  1.0  1.0
b  1.0  1.0  NaN
c  1.0  NaN  1.0

In [91]:
df.fillna(-1)

     x    y    z
a  2.0  1.0  1.0
b  1.0  1.0 -1.0
c  1.0 -1.0  1.0